In [42]:
import pandas as pd

In [43]:
  # Tỷ lệ thất nghiệp (%)
df_unemployment = pd.read_csv(r"C:\Users\Admin\Desktop\TANPHAT\hocotruong\Năm ba 2025-2026\HK1_A\Thu thập và tiền xử lý dữ liệu\Đồ_án_GDP\data\data_download\unemployment-rate.csv")

In [44]:
df_unemployment.head()

,Entity,Code,Year,"Unemployment, total (% of total labor force) (modeled ILO estimate)"
0,Vietnam,VNM,1991,2.142
1,Vietnam,VNM,1992,2.110
2,Vietnam,VNM,1993,2.038
3,Vietnam,VNM,1994,1.972
4,Vietnam,VNM,1995,1.955

In [45]:
df_unemployment.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 34 entries, 0 to 33
Data columns (total 4 columns):
 #   Column                                                               Non-Null Count  Dtype
---  ------                                                               --------------  -----
 0   Entity                                                               34 non-null     object
 1   Code                                                                 34 non-null     object
 2   Year                                                                 34 non-null     int64
 3   Unemployment, total (% of total labor force) (modeled ILO estimate)  34 non-null     float64
dtypes: float64(1), int64(1), object(2)
memory usage: 1.2+ KB

In [46]:
df_unemployment.columns

Index(['Entity', 'Code', 'Year',
       'Unemployment, total (% of total labor force) (modeled ILO estimate)'],
      dtype='object')

In [47]:
df_unemployment.describe()

,Year,"Unemployment, total (% of total labor force) (modeled ILO estimate)"
count,34.000000,34.000000
mean,2007.500000,1.886882
std,9.958246,0.455517
min,1991.000000,0.999000
25%,1999.250000,1.654000
50%,2007.500000,1.963500
75%,2015.750000,2.135000
max,2024.000000,2.870000

In [48]:
df_unemployment.isna().sum()

Entity                                                                 0
Code                                                                   0
Year                                                                   0
Unemployment, total (% of total labor force) (modeled ILO estimate)    0
dtype: int64

In [49]:
df_unemployment = (df_unemployment[['Year',r'Unemployment, total (% of total labor force) (modeled ILO estimate)']])
df_unemployment.rename(columns={r'Unemployment, total (% of total labor force) (modeled ILO estimate)':'df_unemployment_value','Year' : 'date' },inplace= True)
df_unemployment.sort_values('date').reset_index(drop=True)

    date  df_unemployment_value
0   1991                  2.142
1   1992                  2.110
2   1993                  2.038
3   1994                  1.972
4   1995                  1.955
5   1996                  1.930
6   1997                  2.870
7   1998                  2.290
8   1999                  2.330
9   2000                  2.260
10  2001                  2.760
11  2002                  2.120
12  2003                  2.250
13  2004                  2.140
14  2005                  2.078
15  2006                  2.046
16  2007                  2.026
17  2008                  1.889
18  2009                  1.737
19  2010                  1.114
20  2011                  0.999
21  2012                  1.027
22  2013                  1.316
23  2014                  1.256
24  2015                  1.848
25  2016                  1.848
26  2017                  1.874
27  2018                  1.161
28  2019                  1.681
29  2020                  2.103
30  2021                  2.385
31  2022                  1.523
32  2023                  1.645
33  2024                  1.431

In [50]:
# Chuẩn hóa tên cột
df_unemployment.columns = (
    df_unemployment.columns
    .str.strip()
    .str.lower()
    .str.replace(' ', '_')
    .str.replace('[()%/,]', '', regex=True)  # bỏ ký tự đặc biệt
    .str.replace('__+', '_')                 # bỏ dấu _ thừa
)

In [51]:
df_unemployment.head()

   date  df_unemployment_value
0  1991                  2.142
1  1992                  2.110
2  1993                  2.038
3  1994                  1.972
4  1995                  1.955